mamedev/mame/src/devices/cpu/tms320c3x/tms320c3x.cpp
// license:BSD-3-Clause
// copyright-holders:Aaron Giles
/***************************************************************************

    tms320c3x.cpp

    TMS320C3x family 32-bit floating point DSP emulator

    TMS320C3x family difference table:

    |-------------------|-------------------|-------------------|-------------------|
    | Feature           | 'C30              | 'C31/'VC33        | 'C32              |
    |-------------------|-------------------|-------------------|-------------------|
    | External Bus      | Two buses:        | One bus:          | One bus:          |
    |                   | Primary bus:      | 32-bit data       | 32-bit data       |
    |                   | 32-bit data       | 24-bit address    | 24-bit address    |
    |                   | 24-bit address    | STRB active for   | STRB active for   |
    |                   | STRB active for   | 000000-7FFFFFh    | 000000-7FFFFFh    |
    |                   | 000000-7FFFFFh    | and               | and               |
    |                   | and               | 80A000-FFFFFFh    | 880000-8FFFFFh    |
    |                   | 80A000-FFFFFFh    |                   | 8-, 16-, 32-bit   |
    |                   | Expansion bus:    |                   | data in           |
    |                   | 32-bit data       |                   | 8-, 16-, 32-bit   |
    |                   | 13-bit address    |                   | wide memory       |
    |                   | MSTRB active for  |                   | STRB1 active for  |
    |                   | 800000-801FFFh    |                   | 900000-FFFFFFh    |
    |                   | IOSTRB active for |                   | 8-, 16-, 32-bit   |
    |                   | 804000-805FFFh    |                   | data in           |
    |                   |                   |                   | 8-, 16-, 32-bit   |
    |                   |                   |                   | wide memory       |
    |                   |                   |                   | IOSTRB active for |
    |                   |                   |                   | 810000-82FFFFh    |
    |-------------------|-------------------|-------------------|-------------------|
    | ROM (Words)       | 4K                | No                | No                |
    |-------------------|-------------------|-------------------|-------------------|
    | Boot Loader       | No                | Yes               | Yes               |
    |-------------------|-------------------|-------------------|-------------------|
    | On-Chip RAM       | 2k                | 2k('31)/34k('33)  | 512               |
    | (Words)           | Address:          | Address:          | Address:          |
    |                   | 809800-809fff     | 809800-809fff     | 87fe00-87ffff     |
    |                   |                   | ('C31,'VC33)      |                   |
    |                   |                   | 800000-807fff     |                   |
    |                   |                   | ('VC33 only)      |                   |
    |-------------------|-------------------|-------------------|-------------------|
    | DMA               | 1 Channel         | 1 Channel         | 2 Channels        |
    |                   | CPU greater       | CPU greater       | Configurable      |
    |                   | priority then DMA | priority then DMA | priorities        |
    |-------------------|-------------------|-------------------|-------------------|
    | Serial Ports      | 2                 | 1                 | 1                 |
    |-------------------|-------------------|-------------------|-------------------|
    | Timers            | 2                 | 2                 | 2                 |
    |-------------------|-------------------|-------------------|-------------------|
    | Interrupts        | Level-Triggered   | Level-Triggered   | Level-Triggered   |
    |                   |                   |                   | or combination of |
    |                   |                   |                   | edge- and         |
    |                   |                   |                   | level-triggered   |
    |-------------------|-------------------|-------------------|-------------------|
    | Interrupt vector  | Fixed 0-3Fh       | Microprocessor:   | Relocatable       |
    | table             |                   | 0-3Fh fixed       |                   |
    |                   |                   | Boot loader:      |                   |
    |                   |                   | 809FC1-809FFF     |                   |
    |                   |                   | fixed             |                   |
    |-------------------|-------------------|-------------------|-------------------|

    TODO:
    - merge and implement internal peripheral emulations
    - implement chip family difference
    - interlocked operation
    - instruction pipelining

***************************************************************************/

#include "emu.h"
#include "tms320c3x.h"

#include "tms320c3x_dasm.h"

#include <bit>


//**************************************************************************
//  CONSTANTS
//**************************************************************************

// indexes into the register file
enum
{
	TMR_R0 = 0,
	TMR_R1,
	TMR_R2,
	TMR_R3,
	TMR_R4,
	TMR_R5,
	TMR_R6,
	TMR_R7,
	TMR_AR0,
	TMR_AR1,
	TMR_AR2,
	TMR_AR3,
	TMR_AR4,
	TMR_AR5,
	TMR_AR6,
	TMR_AR7,
	TMR_DP,
	TMR_IR0,
	TMR_IR1,
	TMR_BK,
	TMR_SP,
	TMR_ST,
	TMR_IE,
	TMR_IF,
	TMR_IOF,
	TMR_RS,
	TMR_RE,
	TMR_RC,
	TMR_R8,     // 3204x only
	TMR_R9,     // 3204x only
	TMR_R10,    // 3204x only
	TMR_R11,    // 3204x only
	TMR_TEMP1,  // used by the interpreter
	TMR_TEMP2,  // used by the interpreter
	TMR_TEMP3   // used by the interpreter
};

// flags
const int CFLAG     = 0x0001;
const int VFLAG     = 0x0002;
const int ZFLAG     = 0x0004;
const int NFLAG     = 0x0008;
const int UFFLAG    = 0x0010;
const int LVFLAG    = 0x0020;
const int LUFFLAG   = 0x0040;
const int OVMFLAG   = 0x0080;
const int RMFLAG    = 0x0100;
//const int CFFLAG    = 0x0400;
//const int CEFLAG    = 0x0800;
//const int CCFLAG    = 0x1000;
const int GIEFLAG   = 0x2000;



//**************************************************************************
//  MACROS
//**************************************************************************

#define IREG(rnum)  (m_r[rnum].i32[0])



//**************************************************************************
//  GLOBAL VARIABLES
//**************************************************************************

// device type definition
DEFINE_DEVICE_TYPE(TMS320C30, tms320c30_device,  "tms320c30",  "Texas Instruments TMS320C30")
DEFINE_DEVICE_TYPE(TMS320C31, tms320c31_device,  "tms320c31",  "Texas Instruments TMS320C31")
DEFINE_DEVICE_TYPE(TMS320C32, tms320c32_device,  "tms320c32",  "Texas Instruments TMS320C32")
DEFINE_DEVICE_TYPE(TMS320C33, tms320vc33_device, "tms320vc33", "Texas Instruments TMS320VC33")

