mamedev/mame/src/devices/cpu/tms320c3x/tms320c3x.cpp
// memory map common to all 'C30 devices
// TODO: expand to cover all the standard internal peripherals
void tms320c3x_device::common_320c3x(address_map &map)
{
	//map(0x808000, 0x808000) DMA (0) Global control
	//map(0x808004, 0x808004) DMA (0) Source address
	//map(0x808006, 0x808006) DMA (0) Destination address
	//map(0x808008, 0x808008) DMA (0) Transfer Counter
	//map(0x808020, 0x808020) Timer 0 Global Control
	//map(0x808024, 0x808024) Timer 0 Counter
	//map(0x808028, 0x808028) Timer 0 Period Register
	//map(0x808030, 0x808030) Timer 1 Global Control
	//map(0x808034, 0x808034) Timer 1 Counter
	//map(0x808038, 0x808038) Timer 1 Period Register
	//map(0x808040, 0x808040) Serial Port (0) Global Control
	//map(0x808042, 0x808042) FSX/DX/CLKX Serial Port (0) Control
	//map(0x808043, 0x808043) FSR/DR/CLKR Serial Port (0) Control
	//map(0x808044, 0x808044) Serial Port (0) R/X Timer Control
	//map(0x808045, 0x808045) Serial Port (0) R/X Timer Counter
	//map(0x808046, 0x808046) Serial Port (0) R/X Timer Period Register
	//map(0x808048, 0x808048) Serial Port (0) Data-Transmit
	//map(0x80804c, 0x80804c) Serial Port (0) Data-Receive
	map(0x808064, 0x808064).rw(FUNC(tms320c3x_device::primary_bus_control_r), FUNC(tms320c3x_device::primary_bus_control_w));
}

// internal memory maps
void tms320c30_device::internal_320c30(address_map &map)
{
	common_320c3x(map);

	//map(0x000000, 0x7fffff) STRB
	//map(0x800000, 0x801fff) MSTRB
	//map(0x804000, 0x805fff) IOSTRB
	//map(0x808050, 0x808050) Serial Port 1 Global Control
	//map(0x808052, 0x808052) FSX/DX/CLKX Serial Port 1 Control
	//map(0x808053, 0x808053) FSR/DR/CLKR Serial Port 1 Control
	//map(0x808054, 0x808054) Serial Port 1 R/X Timer Control
	//map(0x808055, 0x808055) Serial Port 1 R/X Timer Counter
	//map(0x808056, 0x808056) Serial Port 1 R/X Timer Period Register
	//map(0x808058, 0x808058) Serial Port 1 Data-Transmit
	//map(0x80805c, 0x80805c) Serial Port 1 Data-Receive
	//map(0x808060, 0x808060) Expansion-Bus Control
	//map(0x808064, 0x808064) Primary-Bus Control
	map(0x809800, 0x809fff).ram();
	//map(0x809800, 0x809bff).ram(); // RAM block 0
	//map(0x809c00, 0x809fff).ram(); // RAM block 1
	//map(0x80a000, 0xffffff) STRB
}

void tms320c31_device::internal_320c31(address_map &map)
{
	common_320c3x(map);

	//map(0x000000, 0x7fffff) STRB
	//map(0x808064, 0x808064) Primary-Bus Control
	map(0x809800, 0x809fff).ram();
	//map(0x809800, 0x809bff).ram(); // RAM block 0
	//map(0x809c00, 0x809fff).ram(); // RAM block 1
	//map(0x80a000, 0xffffff) STRB
}

void tms320c32_device::internal_320c32(address_map &map)
{
	common_320c3x(map);

	//map(0x000000, 0x7fffff) STRB0
	//map(0x808010, 0x808010) DMA 1 Global control
	//map(0x808014, 0x808014) DMA 1 Source address
	//map(0x808016, 0x808016) DMA 1 Destination address
	//map(0x808018, 0x808018) DMA 1 Transfer Counter
	//map(0x808060, 0x808060) IOSTRB Bus Control
	//map(0x808064, 0x808064) STRB0 Bus Control
	//map(0x808068, 0x808068) STRB1 Bus Control
	//map(0x810000, 0x82ffff) IOSTRB
	map(0x87fe00, 0x87ffff).ram();
	//map(0x87fe00, 0x87feff).ram(); // RAM block 0
	//map(0x87ff00, 0x87ffff).ram(); // RAM block 1
	//map(0x880000, 0x8fffff) STRB0
	//map(0x900000, 0xffffff) STRB1
}

void tms320vc33_device::internal_320vc33(address_map &map)
{
	common_320c3x(map);

	//map(0x000000, 0x7fffff) STRB
	map(0x800000, 0x807fff).ram();
	//map(0x800000, 0x803fff).ram(); // RAM block 2
	//map(0x804000, 0x807fff).ram(); // RAM block 3
	//map(0x808064, 0x808064) Primary-Bus Control
	map(0x809800, 0x809fff).ram();
	//map(0x809800, 0x809bff).ram(); // RAM block 0
	//map(0x809c00, 0x809fff).ram(); // RAM block 1
	//map(0x80a000, 0xffffff) STRB
}


// ROM definitions for the internal boot loader programs
// (Using assembled versions until the code ROMs are extracted from both DSPs)
ROM_START( tms320c30 )
	ROM_REGION(0x4000, "internal_rom", 0)
	ROM_LOAD( "c30boot.bin", 0x0000, 0x4000, BAD_DUMP CRC(bddc2763) SHA1(96b2170ecee5bec5abaa1741bb2d3b6096ecc262)) // TODO: programmable?
ROM_END

ROM_START( tms320c31 )
	ROM_REGION(0x4000, "internal_rom", 0)
	ROM_LOAD( "c31boot.bin", 0x0000, 0x4000, BAD_DUMP CRC(bddc2763) SHA1(96b2170ecee5bec5abaa1741bb2d3b6096ecc262) ) // Assembled from c31boot.asm (02-07-92)
ROM_END

ROM_START( tms320c32 )
	ROM_REGION(0x4000, "internal_rom", 0)
	ROM_LOAD( "c32boot.bin", 0x0000, 0x4000, BAD_DUMP CRC(ecf84729) SHA1(4d32ead450f921f563514b061ea561a222283616) ) // Assembled from c32boot.asm (03-04-96)
ROM_END



//**************************************************************************
//  TMSREG REGISTER
//**************************************************************************

//-------------------------------------------------
//  as_float - interpret the contents of a tmsreg
//  as a DSP-encoded floating-point value, and
//  extract a 32-bit IEEE float from it
//-------------------------------------------------

float tms320c3x_device::tmsreg::as_float() const
{
	int_double id;

	// map 0 to 0
	if (mantissa() == 0 && exponent() == -128)
		return 0;

	// handle positive numbers
	else if (mantissa() >= 0)
	{
		int exp = (exponent() + 127) << 23;
		id.i[0] = exp + (mantissa() >> 8);
	}

	// handle negative numbers
	else
	{
		int exp = (exponent() + 127) << 23;
		int32_t man = -mantissa();
		id.i[0] = 0x80000000 + exp + ((man >> 8) & 0x00ffffff);
	}

	// return the converted float
	return id.f[0];
}


//-------------------------------------------------
//  as_double - interpret the contents of a tmsreg
//  as a DSP-encoded floating-point value, and
//  extract a 64-bit IEEE double from it
//-------------------------------------------------

double tms320c3x_device::tmsreg::as_double() const
{
	int_double id;

	// map 0 to 0
	if (mantissa() == 0 && exponent() == -128)
		return 0;

	// handle positive numbers
	else if (mantissa() >= 0)
	{
		int exp = (exponent() + 1023) << 20;
		id.i[BYTE_XOR_BE(0)] = exp + (mantissa() >> 11);
		id.i[BYTE_XOR_BE(1)] = (mantissa() << 21) & 0xffe00000;
	}

	// handle negative numbers
	else
	{
		int exp = (exponent() + 1023) << 20;
		int32_t man = -mantissa();
		id.i[BYTE_XOR_BE(0)] = 0x80000000 + exp + ((man >> 11) & 0x001fffff);
		id.i[BYTE_XOR_BE(1)] = (man << 21) & 0xffe00000;
	}

