mamedev/mame/src/devices/cpu/tms320c3x/tms320c3x.cpp
	// return the converted double
	return id.d;
}


//-------------------------------------------------
//  from_double - import a 64-bit IEEE double into
//  the DSP's internal floating point format
//-------------------------------------------------

void tms320c3x_device::tmsreg::from_double(double val)
{
	// extract mantissa and exponent from the IEEE input
	int_double id;
	id.d = val;
	int32_t mantissa = ((id.i[BYTE_XOR_BE(0)] & 0x000fffff) << 11) | ((id.i[BYTE_XOR_BE(1)] & 0xffe00000) >> 21);
	int32_t exponent = ((id.i[BYTE_XOR_BE(0)] & 0x7ff00000) >> 20) - 1023;

	// if we're too small, map to 0
	if (exponent < -128)
	{
		set_mantissa(0);
		set_exponent(-128);
	}

	// if we're too large, map to the maximum value
	else if (exponent > 127)
	{
		if ((int32_t)id.i[BYTE_XOR_BE(0)] >= 0)
			set_mantissa(0x7fffffff);
		else
			set_mantissa(0x80000001);
		set_exponent(127);
	}

	// if we're positive, map directly
	else if ((int32_t)id.i[BYTE_XOR_BE(0)] >= 0)
	{
		set_mantissa(mantissa);
		set_exponent(exponent);
	}

	// if we're negative with a non-zero mantissa, remove the leading sign bit
	else if (mantissa != 0)
	{
		set_mantissa(0x80000000 | -mantissa);
		set_exponent(exponent);
	}

	// if we're negative with a zero mantissa, normalize
	else
	{
		set_mantissa(0x80000000);
		set_exponent(exponent - 1);
	}
}



//**************************************************************************
//  DEVICE INTERFACE
//**************************************************************************

//-------------------------------------------------
//  tms320c3x_device - constructor
//-------------------------------------------------

tms320c3x_device::tms320c3x_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock, uint32_t chiptype, int clock_per_inst, address_map_constructor internal_map)
	: cpu_device(mconfig, type, tag, owner, clock),
		m_program_config("program", ENDIANNESS_LITTLE, 32, 24, -2, internal_map),
		m_chip_type(chiptype),
		m_pc(0),
		m_bkmask(0),
		m_primary_bus_control(0),
		m_irq_state(0),
		m_delayed(false),
		m_irq_pending(false),
		m_is_idling(false),
		m_icount(0),
		m_clock_per_inst(clock_per_inst),  // 1('VC33)/2 clocks per cycle
		m_internal_rom(*this, "internal_rom"),
		m_mcbl_mode(false),
		m_is_lopower(false),
		m_xf0_cb(*this),
		m_xf1_cb(*this),
		m_iack_cb(*this),
		m_holda_cb(*this)
{
	// initialize remaining state
	memset(&m_r, 0, sizeof(m_r));

	// set our instruction counter
	set_icountptr(m_icount);

#if (TMS320C3X_LOG_OPCODE_USAGE)
	memset(m_hits, 0, sizeof(m_hits));
#endif
}

tms320c30_device::tms320c30_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c3x_device(mconfig, TMS320C30, tag, owner, clock, CHIP_TYPE_TMS320C30, 2, address_map_constructor(FUNC(tms320c30_device::internal_320c30), this))
{
}

tms320c31_device::tms320c31_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c3x_device(mconfig, TMS320C31, tag, owner, clock, CHIP_TYPE_TMS320C31, 2, address_map_constructor(FUNC(tms320c31_device::internal_320c31), this))
{
}

tms320c32_device::tms320c32_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c3x_device(mconfig, TMS320C32, tag, owner, clock, CHIP_TYPE_TMS320C32, 2, address_map_constructor(FUNC(tms320c32_device::internal_320c32), this))
{
}

tms320vc33_device::tms320vc33_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c3x_device(mconfig, TMS320C33, tag, owner, clock, CHIP_TYPE_TMS320C31, 1, address_map_constructor(FUNC(tms320vc33_device::internal_320vc33), this))
{
}

//-------------------------------------------------
//  ~tms320c3x_device - destructor
//-------------------------------------------------

tms320c3x_device::~tms320c3x_device()
{
#if (TMS320C3X_LOG_OPCODE_USAGE)
	for (int i = 0; i < std::size(m_hits); i++)
		if (m_hits[i] != 0)
			printf("%10d - %03X.%X\n", m_hits[i], i / 4, i % 4);
#endif
}


//-------------------------------------------------
//  rom_region - return a pointer to the device's
//  internal ROM region
//-------------------------------------------------

const tiny_rom_entry *tms320c30_device::device_rom_region() const
{
	return ROM_NAME( tms320c30 );
}

const tiny_rom_entry *tms320c31_device::device_rom_region() const
{
	return ROM_NAME( tms320c31 );
}

const tiny_rom_entry *tms320c32_device::device_rom_region() const
{
	return ROM_NAME( tms320c32 );
}

const tiny_rom_entry *tms320vc33_device::device_rom_region() const
{
	return ROM_NAME( tms320c31 );
}


//-------------------------------------------------
//  ROPCODE - fetch an opcode
//-------------------------------------------------

inline uint32_t tms320c3x_device::ROPCODE(offs_t pc)
{
	return m_cache.read_dword(pc);
}


//-------------------------------------------------
//  RMEM - read memory
//-------------------------------------------------

inline uint32_t tms320c3x_device::RMEM(offs_t addr)
{
	return m_program.read_dword(addr);
}


//-------------------------------------------------
//  WMEM - write memory
//-------------------------------------------------

inline void tms320c3x_device::WMEM(offs_t addr, uint32_t data)
{
	m_program.write_dword(addr, data);
}


//-------------------------------------------------
//  device_start - start up the device
//-------------------------------------------------

void tms320c3x_device::device_start()
{
	// find address spaces
	space(AS_PROGRAM).cache(m_cache);
	space(AS_PROGRAM).specific(m_program);

	// set up the internal boot loader ROM
	if (m_mcbl_mode)
	{
		if (m_internal_rom->base() != nullptr)
			m_program.space().install_rom(0x000000, 0x000fff, m_internal_rom->base());
		else
			m_program.space().unmap_read(0x000000, 0x000fff);
	}

	// save state
	save_item(NAME(m_pc));
	for (int regnum = 0; regnum < 36; regnum++)
		save_item(NAME(m_r[regnum].i32), regnum);
	save_item(NAME(m_bkmask));
	save_item(NAME(m_primary_bus_control));
	save_item(NAME(m_irq_state));
	save_item(NAME(m_delayed));
	save_item(NAME(m_irq_pending));
	save_item(NAME(m_is_idling));
	save_item(NAME(m_mcbl_mode));
	save_item(NAME(m_hold_state));
	save_item(NAME(m_is_lopower));

	// register our state for the debugger
	state_add(TMS320C3X_PC,      "PC",        m_pc);
	state_add(STATE_GENPC,      "GENPC",     m_pc).noshow();
	state_add(STATE_GENPCBASE,  "CURPC",     m_pc).noshow();
	state_add(STATE_GENFLAGS,   "GENFLAGS",  m_r[TMR_ST].i32[0]).mask(0xff).noshow().formatstr("%8s");
	state_add(TMS320C3X_R0,      "R0",        m_r[TMR_R0].i32[0]);
	state_add(TMS320C3X_R1,      "R1",        m_r[TMR_R1].i32[0]);
	state_add(TMS320C3X_R2,      "R2",        m_r[TMR_R2].i32[0]);
	state_add(TMS320C3X_R3,      "R3",        m_r[TMR_R3].i32[0]);
	state_add(TMS320C3X_R4,      "R4",        m_r[TMR_R4].i32[0]);
	state_add(TMS320C3X_R5,      "R5",        m_r[TMR_R5].i32[0]);
	state_add(TMS320C3X_R6,      "R6",        m_r[TMR_R6].i32[0]);
	state_add(TMS320C3X_R7,      "R7",        m_r[TMR_R7].i32[0]);
	state_add(TMS320C3X_R0F,     "R0F",       m_iotemp).callimport().callexport().formatstr("%12s");
	state_add(TMS320C3X_R1F,     "R1F",       m_iotemp).callimport().callexport().formatstr("%12s");
	state_add(TMS320C3X_R2F,     "R2F",       m_iotemp).callimport().callexport().formatstr("%12s");
	state_add(TMS320C3X_R3F,     "R3F",       m_iotemp).callimport().callexport().formatstr("%12s");
	state_add(TMS320C3X_R4F,     "R4F",       m_iotemp).callimport().callexport().formatstr("%12s");
	state_add(TMS320C3X_R5F,     "R5F",       m_iotemp).callimport().callexport().formatstr("%12s");
	state_add(TMS320C3X_R6F,     "R6F",       m_iotemp).callimport().callexport().formatstr("%12s");
	state_add(TMS320C3X_R7F,     "R7F",       m_iotemp).callimport().callexport().formatstr("%12s");
	state_add(TMS320C3X_AR0,     "AR0",       m_r[TMR_AR0].i32[0]);
	state_add(TMS320C3X_AR1,     "AR1",       m_r[TMR_AR1].i32[0]);
	state_add(TMS320C3X_AR2,     "AR2",       m_r[TMR_AR2].i32[0]);
	state_add(TMS320C3X_AR3,     "AR3",       m_r[TMR_AR3].i32[0]);
	state_add(TMS320C3X_AR4,     "AR4",       m_r[TMR_AR4].i32[0]);
	state_add(TMS320C3X_AR5,     "AR5",       m_r[TMR_AR5].i32[0]);
	state_add(TMS320C3X_AR6,     "AR6",       m_r[TMR_AR6].i32[0]);
	state_add(TMS320C3X_AR7,     "AR7",       m_r[TMR_AR7].i32[0]);
	state_add(TMS320C3X_DP,      "DP",        m_r[TMR_DP].i32[0]).mask(0xff);
	state_add(TMS320C3X_IR0,     "IR0",       m_r[TMR_IR0].i32[0]);
	state_add(TMS320C3X_IR1,     "IR1",       m_r[TMR_IR1].i32[0]);
	state_add(TMS320C3X_BK,      "BK",        m_r[TMR_BK].i32[0]);
	state_add(TMS320C3X_SP,      "SP",        m_r[TMR_SP].i32[0]);
	state_add(TMS320C3X_ST,      "ST",        m_r[TMR_ST].i32[0]);
	state_add(TMS320C3X_IE,      "IE",        m_r[TMR_IE].i32[0]);
	state_add(TMS320C3X_IF,      "IF",        m_r[TMR_IF].i32[0]);
	state_add(TMS320C3X_IOF,     "IOF",       m_r[TMR_IOF].i32[0]);
	state_add(TMS320C3X_RS,      "RS",        m_r[TMR_RS].i32[0]);
	state_add(TMS320C3X_RE,      "RE",        m_r[TMR_RE].i32[0]);
	state_add(TMS320C3X_RC,      "RC",        m_r[TMR_RC].i32[0]);
}


//-------------------------------------------------
//  device_reset - reset the device
//-------------------------------------------------

